Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK0512GC01064.atdf
        <register name="BDCTRLCRC" offset="0xE" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR CRC CONTROL">
          <bitfield name="CRCMD" caption="CRC/Checksum Mode" mask="0x7" values="BDCTRLCRC__CRCMD"/>
          <bitfield name="CRCAPP" caption="CRC Append Mode" mask="0x8"/>
          <bitfield name="CRCXOR" caption="CRC XOR Mode" mask="0x20"/>
          <bitfield name="CRCROUT" caption="CRC Reflected Output Mode" mask="0x40"/>
          <bitfield name="CRCRIN" caption="CRC Reflect Input Selection" mask="0x80"/>
        </register>
        <register name="BDSSA" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR SOURCE START ADDRESS">
          <bitfield name="SSA" caption="Source Start Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDDSA" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR DESTINATION START ADDRESS">
          <bitfield name="DSA" caption="Destination Start Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="BDSSTRD" offset="0x18" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR SOURCE CELL STRIDE">
          <bitfield name="SSTRD" caption="Source Stride Size" mask="0xFFFF"/>
        </register>
        <register name="BDDSTRD" offset="0x1A" rw="RW" size="2" initval="0x0000" caption="CURRENT BUFFER DESCRIPTOR DESTINATION CELL STRIDE">
          <bitfield name="DSTRD" caption="Destination Stride Size" mask="0xFFFF"/>
        </register>
        <register name="BDXSIZ" offset="0x1C" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR TRANSFER SIZE">
          <bitfield name="CSZ" caption="Cell transfer size in bytes." mask="0x3FF"/>
          <bitfield name="BLKSZ" caption="Block transfer size in bytes." mask="0xFFFF0000"/>
        </register>
        <register name="BDPDAT" offset="0x20" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR PATTERN MATCH DATA">
          <bitfield name="PDAT" caption="Channel Pattern Match Data" mask="0xFFFF"/>
          <bitfield name="PIGN" caption="Channel Pattern Ignore Value" mask="0xFF000000"/>
        </register>
        <register name="BDCRCDAT" offset="0x24" rw="RW" size="4" initval="0x00000000" caption="CURRENT BUFFER DESCRIPTOR CRC/CHECKSUM DATA">
          <bitfield name="CRCDAT" caption="CRC/Checksum Data Register" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CHCTRLB__WAS">
        <value name="BYTE_ADDR_INCR" caption="Incrementing Address+1 with Transfers of Byte Operands" value="0"/>
        <value name="HALF_WORD_ADDR_INCR" caption="Incrementing Address+2 with Transfers of HalfWord Operands" value="1"/>
        <value name="AUTO_ADDR_INCR" caption="Auto Increment Address and Transfer Size" value="2"/>
        <value name="FIXED_BYTE_ADDR_INCR" caption="Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)" value="3"/>
        <value name="FIXED_HALF_WORD_ADDR_INCR" caption="Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)" value="4"/>
        <value name="FIXED_WORD_ADDR_INCR" caption="Fixed Address Word Burst Transfer" value="5"/>
      </value-group>
      <value-group name="CHCTRLB__RAS">
        <value name="BYTE_ADDR_INCR" caption="Incrementing Address+1 with Transfers of Byte Operands" value="0"/>
        <value name="HALF_WORD_ADDR_INCR" caption="Incrementing Address+2 with Transfers of HalfWord Operands" value="1"/>
        <value name="AUTO_ADDR_INCR" caption="Auto Increment Address and Transfer Size" value="2"/>
        <value name="FIXED_BYTE_ADDR_INCR" caption="Fixed Byte Address (Single Byte Address with Enable Based upon 2 LSBs)" value="3"/>
        <value name="FIXED_HALF_WORD_ADDR_INCR" caption="Fixed Address of HalfWord Operand (Single HalfWord Aligned Address)" value="4"/>
        <value name="FIXED_WORD_ADDR_INCR" caption="Fixed Address Word Burst Transfer" value="5"/>
      </value-group>
      <value-group name="CHCTRLB__PRI">
        <value name="PRI_1" caption="Channel Priority is 1" value="0"/>
        <value name="PRI_2" caption="Channel Priority is 2" value="1"/>
        <value name="PRI_3" caption="Channel Priority is 3 (HIGHEST)" value="2"/>
      </value-group>
      <value-group name="CHCTRLB__BYTORD">
        <value name="BYTORD_NONE" caption="Bytes are processed AS IS" value="0"/>
        <value name="BYTORD_WORD_SWIZZLE" caption="Bytes are swapped as: BYTE3 to BYTE0, BYTE2 to BYTE1, BYTE1 to BYTE2, and BYTE0 to BYTE3" value="1"/>
        <value name="BYTORD_HALF_WORD_SWIZZLE" caption="Bytes are swapped as: BYTE3 to BYTE1, BYTE2 to BYTE0, BYTE1 to BYTE3, and BYTE0 to BYTE2" value="2"/>
        <value name="BYTORD_BYTE_SWIZZLE" caption="Bytes are swapped as: BYTE3 to BYTE2, BYTE2 to BYTE3, BYTE1 to BYTE1, and BYTE0 to BYTE1" value="3"/>
      </value-group>
      <value-group name="CHEVCTRL__EVAUXACT">
        <value name="ABORT_BLK_XFER" caption="Event Aborts Bock Transfer" value="0"/>
        <value name="INCR_CHN_PRI" caption="Event Increments Channel Priority" value="1"/>
        <value name="COND_TRIG" caption="Event acts as a Conditional Trigger" value="2"/>
      </value-group>
      <value-group name="CHEVCTRL__EVOMODE">
        <value name="STRB_ON_BLCK_XFER" caption="Generate a channel event strobe for 1 clock cycle at the end of block transfer" value="0"/>
        <value name="STRB_ON_CELL_XFER" caption="Generate a channel event strobe for 1 clock cycle at the end of cell transfer" value="1"/>
        <value name="STRB_START_EVT_TRG_TO_CELL_XFER_READ" caption="Generate a channel event strobe from start event trigger to the completion of cell transfer read" value="2"/>
        <value name="STRB_START_EVT_TRG_TO_CELL_XFER_WRITE" caption="Generate a channel event strobe from start event trigger to the completion of cell transfer write" value="3"/>
      </value-group>
      <value-group name="CHCTRLCRC__CRCMD">
        <value name="CRC_16" caption="Normal (0x8005) CRC-16/CRC-16-IBM/CRC-16-ANSI" value="0"/>
        <value name="CRC_16_CCITT" caption="Normal (0x1021) CRC-16-CCITT" value="1"/>
        <value name="16_BIT_CRCPOLYA" caption="CRC-16 based on polynomial provided in CRCPOLYA (POLYA[15:0]) register" value="2"/>
        <value name="16_BIT_CRCPOLYB" caption="CRC-16 based on polynomial provided in CRCPOLYB (POLYB[15:0]) register" value="3"/>
        <value name="CRC_32" caption="Normal (0x04C11DB7) CRC-32" value="4"/>
        <value name="32_BIT_CRCPOLYA" caption="CRC-32 based on polynomial provided in CRCPOLYA register" value="5"/>
        <value name="32_BIT_CRCPOLYB" caption="CRC-32 based on polynomial provided in CRCPOLYB register" value="6"/>
        <value name="IP_HDR_CHECKSUM" caption="Calculate IP header checksum" value="7"/>
      </value-group>
      <value-group name="CTRLB__QOS1">
        <value name="LEVEL_0" caption="QoS level is 0 (lowest)" value="0"/>
        <value name="LEVEL_1" caption="QoS level is 1 (lower)" value="1"/>
        <value name="LEVEL_2" caption="QoS level is 2 (medium)" value="2"/>
        <value name="LEVEL_3" caption="QoS level is 3 (high)" value="3"/>
      </value-group>
      <value-group name="CTRLB__QOS2">
        <value name="LEVEL_0" caption="QoS level is 0 (lowest)" value="0"/>
        <value name="LEVEL_1" caption="QoS level is 1 (lower)" value="1"/>
        <value name="LEVEL_2" caption="QoS level is 2 (medium)" value="2"/>
        <value name="LEVEL_3" caption="QoS level is 3 (high)" value="3"/>
      </value-group>
