Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK0512GC01064.atdf
        <register modes="MODE1" name="INTENCLR" offset="0x8" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="MODE1 Interrupt Enable Clear">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="CMP2" caption="Compare 2 Interrupt Enable" mask="0x400"/>
          <bitfield name="CMP3" caption="Compare 3 Interrupt Enable" mask="0x800"/>
          <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="INTENCLR" offset="0x8" rw="RW" size="2" atomic-op="clear:INTENCLR" initval="0x0000" caption="MODE2 Interrupt Enable Clear">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register modes="MODE0" name="INTENSET" offset="0xA" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="MODE0 Interrupt Enable Set">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="INTENSET" offset="0xA" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="MODE1 Interrupt Enable Set">
          <bitfield name="PER0" caption="Periodic Interval 0 Interrupt Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Interrupt Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Interrupt Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Interrupt Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Interrupt Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Interrupt Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Interrupt Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Interrupt Enable" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="CMP2" caption="Compare 2 Interrupt Enable" mask="0x400"/>
          <bitfield name="CMP3" caption="Compare 3 Interrupt Enable" mask="0x800"/>
          <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="INTENSET" offset="0xA" rw="RW" size="2" atomic-op="set:INTENSET" initval="0x0000" caption="MODE2 Interrupt Enable Set">
          <bitfield name="PER0" caption="Periodic Interval 0 Enable" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1 Enable" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2 Enable" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3 Enable" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4 Enable" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5 Enable" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6 Enable" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7 Enable" mask="0x80"/>
          <bitfield name="ALARM0" caption="Alarm 0 Interrupt Enable" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1 Interrupt Enable" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper Enable" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x8000"/>
        </register>
        <register modes="MODE0" name="INTFLAG" offset="0xC" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="MODE0 Interrupt Flag Status and Clear">
          <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="INTFLAG" offset="0xC" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="MODE1 Interrupt Flag Status and Clear">
          <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
          <bitfield name="CMP0" caption="Compare 0" mask="0x100"/>
          <bitfield name="CMP1" caption="Compare 1" mask="0x200"/>
          <bitfield name="CMP2" caption="Compare 2" mask="0x400"/>
          <bitfield name="CMP3" caption="Compare 3" mask="0x800"/>
          <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="INTFLAG" offset="0xC" rw="RW" size="2" atomic-op="clear:INTFLAG" initval="0x0000" caption="MODE2 Interrupt Flag Status and Clear">
          <bitfield name="PER0" caption="Periodic Interval 0" mask="0x1"/>
          <bitfield name="PER1" caption="Periodic Interval 1" mask="0x2"/>
          <bitfield name="PER2" caption="Periodic Interval 2" mask="0x4"/>
          <bitfield name="PER3" caption="Periodic Interval 3" mask="0x8"/>
          <bitfield name="PER4" caption="Periodic Interval 4" mask="0x10"/>
          <bitfield name="PER5" caption="Periodic Interval 5" mask="0x20"/>
          <bitfield name="PER6" caption="Periodic Interval 6" mask="0x40"/>
          <bitfield name="PER7" caption="Periodic Interval 7" mask="0x80"/>
          <bitfield name="ALARM0" caption="Alarm 0" mask="0x100"/>
          <bitfield name="ALARM1" caption="Alarm 1" mask="0x200"/>
          <bitfield name="TAMPER" caption="Tamper" mask="0x4000"/>
          <bitfield name="OVF" caption="Overflow" mask="0x8000"/>
        </register>
