Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/atdf/PIC32CK0512GC01064.atdf
        <register modes="I2CM" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="I2CM FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="I2CS" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="I2CS FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="SPIM" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="SPIM FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="SPIS" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="SPIS FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="USART_INT" name="FIFOSPACE" offset="0x34" rw="R" size="2" initval="0x0000" caption="USART FIFO Space">
          <bitfield name="TXSPACE" caption="Tx FIFO Empty Space" mask="0x1F"/>
          <bitfield name="RXSPACE" caption="Rx FIFO Filled Space" mask="0x1F00"/>
        </register>
        <register modes="I2CM" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="I2CM FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="I2CS" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="I2CS FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="SPIM" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="SPIM FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="SPIS" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="SPIS FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
        <register modes="USART_INT" name="FIFOPTR" offset="0x36" rw="RW" size="2" initval="0x0000" caption="USART FIFO CPU Pointers">
          <bitfield name="CPUWRPTR" caption="CPU FIFO Write Pointer" mask="0xF"/>
          <bitfield name="CPURDPTR" caption="CPU FIFO Read Pointer" mask="0xF00"/>
        </register>
      </register-group>
      <value-group name="SERCOM_I2CM_CTRLA__FILTSEL">
        <value name="DIS" caption="Disable" value="0x0"/>
        <value name="50NS" caption="Minimum 50ns filter" value="0x2"/>
        <value name="10NS" caption="Minimum 10ns filter" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SLEWRATE">
        <value name="SMM" caption="Standard mode" value="0x0"/>
        <value name="FM" caption="Fast mode" value="0x1"/>
        <value name="FMP" caption="Fast mode plus" value="0x2"/>
        <value name="HS" caption="High-speed mode" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SDAHOLD">
        <value name="DIS" caption="Disable" value="0x0"/>
        <value name="75NS" caption="50ns - 100ns hold time" value="0x1"/>
        <value name="450NS" caption="300ns - 600ns hold time" value="0x2"/>
        <value name="600NS" caption="400ns - 800ns hold time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__SPEED">
        <value name="SM" caption="Standard-Mode (SM) and Fast-Mode (FM)" value="0x0"/>
        <value name="FMP" caption="Fast-Mode Plus (FM+)" value="0x1"/>
        <value name="HS" caption="High-Speed Mode" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__INACTOUT">
        <value name="DIS" caption="Disable" value="0x0"/>
        <value name="55US" caption="5-6 SCL cycle time-out" value="0x1"/>
        <value name="105US" caption="10-11 SCL cycle time-out" value="0x2"/>
        <value name="205US" caption="20-21-6 SCL cycle time-out" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CM_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SLEWRATE">
        <value name="SM" caption="Standard mode" value="0x0"/>
        <value name="FM" caption="Fast mode" value="0x1"/>
        <value name="FMP" caption="Fast mode plus" value="0x2"/>
        <value name="HS" caption="High-speed mode" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SDAHOLD">
        <value name="DIS" caption="Disable" value="0x0"/>
        <value name="75NS" caption="50ns - 100ns hold time" value="0x1"/>
        <value name="450NS" caption="300ns - 600ns hold time" value="0x2"/>
        <value name="600NS" caption="400ns - 800ns hold time" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_I2CS_CTRLA__SPEED">
        <value name="SM" caption="Standard-Mode (SM) and Fast-Mode (FM)" value="0x0"/>
        <value name="FMP" caption="Fast-Mode Plus (FM+)" value="0x1"/>
        <value name="HS" caption="High-Speed Mode" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__MODE">
        <value name="USART_EXT_CLK" caption="USART with external clock" value="0x0"/>
        <value name="USART_INT_CLK" caption="USART with internal clock" value="0x1"/>
        <value name="SPI_SLAVE" caption="SPI in slave operation" value="0x2"/>
        <value name="SPI_MASTER" caption="SPI in master operation" value="0x3"/>
        <value name="I2C_SLAVE" caption="I2C slave operation" value="0x4"/>
        <value name="I2C_MASTER" caption="I2C master operation" value="0x5"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DOPO">
        <value name="PAD0" caption="DO on PAD[0], SCK on PAD[1] and SS on PAD[2]" value="0x0"/>
        <value name="PAD2" caption="DO on PAD[3], SCK on PAD[1] and SS on PAD[2]" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__DIPO">
        <value name="PAD0" caption="SERCOM PAD0 is used as data input" value="0x0"/>
        <value name="PAD1" caption="SERCOM PAD1 is used as data input" value="0x1"/>
        <value name="PAD2" caption="SERCOM PAD2 is used as data input" value="0x2"/>
        <value name="PAD3" caption="SERCOM PAD3 is used as data input" value="0x3"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__FORM">
        <value name="SPI" caption="SPI frame" value="0x0"/>
        <value name="ADDR" caption="SPI frame with address" value="0x2"/>
      </value-group>
      <value-group name="SERCOM_SPIM_CTRLA__CPHA">
        <value name="LEADING_EDGE" caption="The data is sampled on a leading SCK edge and changed on a trailing SCK edge" value="0x0"/>
        <value name="TRAILING_EDGE" caption="The data is sampled on a trailing SCK edge and changed on a leading SCK edge" value="0x1"/>
      </value-group>
